[net]
# Testing
batch=1
subdivisions=1
# Training
# batch=64
# subdivisions=2
width=320
height=320
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.001
# 在迭代次数小于burn_in时，学习率的更新有一种方式，大于burn_in时，才采用policy的更新方式
burn_in=1000
max_batches = 40000
policy=steps
steps=25000,35000,40000
scales=.1,.1,.2

[convolutional]
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=1

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=leaky

###########

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=21
activation=linear


#在yoloV2中yolo层叫region层,这一层预测第3 4 5个 anchor boxes ，每个yolo层实际上只预测3个由mask定义的anchors

[yolo]
mask = 3,4,5
anchors = 40,46, 59,79, 78,115, 106,117, 86,142, 110,159
classes=2
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1

[route]
layers = -4

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

# 主要是把输入层连接在一起, 如果层的索引为负，则在当前层往后索引,为正，则直接使用该层索引
[route]
layers = -1, 8

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=21
activation=linear

[yolo]
mask = 0,1,2
anchors = 40,46, 59,79, 78,115, 106,117, 86,142, 110,159
classes=2
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1
